[
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "Hello again. Welcome back for our third session. Before we begin, I'd like to check in on how you've been feeling overall since we last met."
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "Hi. It's been an interesting week. I've been trying to use the 'STOP' method and journaling like we discussed. It's made me more aware of how often I get irritated."
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "Increased awareness is a huge step—it means you're catching the emotion earlier. Did you have a chance to use the 'STOP' technique in a real situation?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "I did. A couple days ago, my partner was running late for dinner plans we had, and I felt myself getting really frustrated. I remembered to Stop, Take a breath, and Observe. I realized I was thinking, 'They don't value my time,' and my shoulders were tense."
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "That's excellent work. What did you decide to do when you got to 'Proceed'?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "Instead of texting something sarcastic, I just texted, 'No rush, let me know when you're on your way.' It felt... calmer."
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "That's a concrete example of choosing a different, healthier response. I'm really glad to hear that. In your journaling, did you notice any patterns connecting this situation or others to past feelings, like we talked about with your dad?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "Yeah, actually. When I was observing my thoughts, 'They don't value my time' felt really similar to 'Nobody cares about me' from the coworker thing. And that... that does trace back. Feeling like my time or my side of the story didn't matter when I was a kid."
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "You're doing the crucial work of connecting these dots. That core belief of 'I don't matter' is a powerful trigger. When you feel it flare up now, you can acknowledge it: 'That old feeling is here. But I am an adult, and I can choose how to respond.' How does it feel to name it that way?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "It makes it feel less huge. Like it's a thing I can look at, not just a wave that crashes over me."
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "Beautifully said. That's the space we're creating. Now, I want to introduce another layer. Anger is often a secondary emotion—it covers up something more vulnerable underneath, like hurt, fear, or shame. In that moment with your partner, beneath the anger of 'they don't value my time,' what else might have been there?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "Hmm. Maybe... disappointment? I was looking forward to it. And a little worry, like, 'Did something happen?'"
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "Exactly. Disappointment and worry. Those are more vulnerable feelings. If you could communicate *those* feelings calmly, what would that sound like?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "I guess... 'I was really looking forward to our dinner, and I got a little worried when I didn't hear from you.'"
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "That is a fantastic example of assertive, non-blaming communication. It comes from a place of expressing your need rather than accusing. Would you be willing to practice that with me now? We can role-play that scenario."
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "Okay, I can try."
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "Great. I'll be your partner who just arrived. You've already used 'STOP' and are feeling calm. How would you start?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "'Hey, I'm glad you're here safe. I was actually getting a bit worried about you, and I was really excited for our dinner.'"
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "That is clear, kind, and effective. How did it feel to say that in practice?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "It felt more honest, and less like I was starting a fight."
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "Perfect. You're building a whole new toolkit: awareness through STOP, understanding the historical trigger, and now communicating the primary emotion. For the coming week, I have a two-part goal. First, continue journaling with a new question: 'What vulnerable feeling was under my anger?' Second, try to express that feeling once using an 'I feel...' statement, like you just practiced. How does that sound?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "That sounds challenging, but in a good way. I can try that."
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "Trying is all we ask. Remember, the goal isn't perfection, it's progress. You're already showing so much of that. Is there anything else from the past week you'd like to discuss before we wrap up?"
  },
  {
    "conversation_id": "anger3",
    "speaker": "client",
    "text": "No, I think that covers it. The idea of anger covering up other feelings... that's going to give me a lot to think about."
  },
  {
    "conversation_id": "anger3",
    "speaker": "therapist",
    "text": "It's a powerful insight. Sit with it gently. I'll see you next week. Keep up the great work."
  }
]