[
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "Welcome. This is our planned final session. I'd like to start by checking in on how you're feeling about that, and then we can look back at the journey we've taken together."
  },
  {
    "conversation_id": "anger5",
    "speaker": "client",
    "text": "A little nervous, to be honest. It's been really helpful having this space. I'm worried about managing on my own."
  },
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "That's a very common and understandable feeling. Today is less about an ending and more about consolidating your toolkit and recognizing your own growth. How did the reflective journaling go this past week?"
  },
  {
    "conversation_id": "anger5",
    "speaker": "client",
    "text": "It was better. I didn't force it in the moment. I got cut off in traffic on Tuesday, and instead of stewing all day, I thought about it later. The anger was definitely covering up feeling powerless and a little scared. It was so different from my old reaction."
  },
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "That is a profound shift. You moved from being submerged in the emotion to being an observer of it. That's the core of emotional regulation. Let's do a full review. Walk me through your personal process now, from trigger to response. What's your sequence?"
  },
  {
    "conversation_id": "anger5",
    "speaker": "client",
    "text": "Okay. First, I feel the physical signs—my chest gets tight. That's my cue to **Stop**. Then I **Take** a few deep breaths. I try to **Observe**: What am I thinking? What's the feeling underneath the heat? Is this connected to an old story? Then I decide how to **Proceed**. Sometimes that's walking away, sometimes it's using an 'I feel' statement, sometimes it's just acknowledging the hurt to myself."
  },
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "You've articulated that beautifully. You're not just reacting; you're following a protocol you built. That's empowerment. What would you say is the most important insight you're taking away from our work?"
  },
  {
    "conversation_id": "anger5",
    "speaker": "client",
    "text": "That my anger isn't a random explosion. It's a signal. It's telling me that something feels unfair or threatening, and often it's pointing to an old wound or a vulnerable feeling I need to acknowledge. It's information, not just an enemy."
  },
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "That is an incredibly powerful reframe—from enemy to messenger. With that understanding, you can choose to listen to the message without letting it dictate your actions. Now, let's talk about the future. What are your 'high-risk' situations, and what's your plan for them?"
  },
  {
    "conversation_id": "anger5",
    "speaker": "client",
    "text": "Family gatherings are a big one. Old dynamics. My plan is to go in with a clear intention—like 'I will listen more than I react'—and to give myself permission to take a five-minute break outside if I feel overwhelmed. To use STOP privately in the bathroom if I need to."
  },
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "Excellent. That's proactive, not just reactive. And at work, with deadlines or criticism?"
  },
  {
    "conversation_id": "anger5",
    "speaker": "client",
    "text": "At work, I plan to use the 'I feel' statement more. Instead of shutting down or getting defensive, I can say, 'I feel concerned about meeting this shifted deadline. Can we discuss priorities?' It addresses the need for respect without the blame."
  },
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "You've moved from feeling controlled by your environment to having strategies to navigate it. That's the goal. Slipping up is part of the process. If you have a moment where you shout or react old-style, what will you do?"
  },
  {
    "conversation_id": "anger5",
    "speaker": "client",
    "text": "I'll try not to beat myself up. I'll journal about it later to figure out what got triggered, and I'll make a plan for a repair if I need to apologize to someone. One setback isn't erasing all the progress."
  },
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "Perfect. That's self-compassion and a growth mindset. You are your own source of understanding now. My role was to help you build that internal resource, and you have. Do you have any final questions or concerns you'd like to address before we close?"
  },
  {
    "conversation_id": "anger5",
    "speaker": "client",
    "text": "I think I just want to say thank you. When I came in, I felt like my anger was this monster ruining my life. Now I feel like I have a map and tools to understand it. It's still there, but I'm in the driver's seat."
  },
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "That means a great deal to hear. You've done the hard work. Remember, this isn't about never feeling anger again. It's about the space between the trigger and your response getting wider, and your choices within that space getting clearer. You have the map and the tools. Keep your journal as a touchstone. I am confident in your ability to manage this."
  },
  {
    "conversation_id": "anger5",
    "speaker": "client",
    "text": "Thank you."
  },
  {
    "conversation_id": "anger5",
    "speaker": "therapist",
    "text": "You are very welcome. It has been a privilege to work with you. I wish you continued growth and peace on your journey."
  }
]