[
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "Hi, welcome back. It's good to see you. How are you feeling as we start our session today?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "Honestly, a bit frustrated. The homework was harder than I thought."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "That's completely valid. I appreciate your honesty. Can you tell me more about what made it challenging?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "Trying to find the feeling under the anger. Sometimes the anger just feels so big and instant, it's like there's nothing underneath it. It just *is*."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "That's an incredibly important observation. The anger can feel all-consuming, like a wall. Did you have a specific instance this week where you tried to look behind that wall?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "Yeah. At work, my boss changed a deadline on a project I'd been working on for weeks, with no explanation. I was furious. I used STOP, which helped me not snap, but when I tried to ask myself what was underneath... I just came up blank."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "First, using STOP successfully in that high-stakes situation is a major victory. Let's focus on that. You paused your reaction. Now, let's gently unpack that 'blank' feeling together. When the deadline changed, what did it mean to you? What was threatened?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "It felt like all my hard work was dismissed. Like my effort didn't count."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "Okay. 'My effort didn't count.' If we translate that into a feeling, what might that be? If someone dismisses your hard work, how does that feel in your heart?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "...Unappreciated. Invisible. Maybe even a little foolish for working so hard."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "There it is. Unappreciated. Invisible. Those are powerful, vulnerable feelings. The anger shouts, 'This is unfair!' to protect you from the quieter, more painful whisper of, 'My work doesn't matter.' Does that resonate?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "It does. It really does. The anger feels strong. Saying I feel 'invisible' feels... weak."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "It takes immense strength to acknowledge that vulnerability. Let's reframe that: recognizing and naming that feeling isn't weak; it's precise. It gives you accurate information about what you need. If you're feeling unappreciated, what's a need you could express?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "I guess... to have my work acknowledged. Or for changes to be communicated with some respect for my time."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "Excellent. So from 'blank' or 'just angry,' we've identified a core feeling (invisible/unappreciated) and a need (acknowledgment/respectful communication). This is the deeper work. Now, we don't always get to express that need in the moment, but acknowledging it to yourself is powerful. It shifts the story from 'My boss is a jerk' to 'I need my effort to be seen.'"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "That makes sense. It feels less like just being mad at the world and more like I understand what's specifically hurting."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "Exactly. You're moving from a generalized reaction to a specific understanding. This is a skill that gets easier with practice. Let's try a quick exercise. I'll name a common anger trigger, and you try to name a possible vulnerable feeling underneath. For example, 'Being cut off in traffic.'"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "Hmm. Feeling disrespected? Or... maybe unsafe?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "Great! Both are valid. How about 'A friend forgets an important plan with you.'"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "Hurt. Or... unimportant to them."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "Perfect. You're getting the hang of this. Now, for this week, I'd like to shift the journaling slightly. Instead of pressure to find the feeling in the heat of the moment, I want you to pick one anger event from your day and write about it later. Ask yourself: 'If my anger was protecting a softer feeling, what might that feeling have been?' Take the pressure off. Just be a detective."
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "Okay, I can do that. It feels more manageable to look back when I'm calm."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "That's the idea. We build the skill in reflection so it becomes more accessible in the moment. Also, continue to use STOP as your first responder. It creates the space for this deeper look. How does this plan feel?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "It feels good. More clear. Last week I felt like I was failing the assignment. This feels like I'm actually learning a new way to see things."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "You weren't failing at all. You were encountering the natural difficulty of the task. What you've done today—pushing through that frustration—is real progress. Is there anything else about the week, or that situation with your boss, that you'd like to discuss?"
  },
  {
    "conversation_id": "anger4",
    "speaker": "client",
    "text": "No, I think we covered it. Understanding that the anger was about feeling invisible actually helps me let go of it a bit. I can see what it was really about now."
  },
  {
    "conversation_id": "anger4",
    "speaker": "therapist",
    "text": "That's the power of this work. It doesn't always change the situation, but it can change how you carry it. I'll see you next week. Be kind to yourself as you practice this detective work."
  }
]