[
  {
    "conversation_id": "substanceUse5",
    "speaker": "therapist",
    "text": "Welcome. As we discussed last time, this is our final scheduled session. How are you feeling coming into today?"
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "client",
    "text": "A mix of things. Proud, honestly. But also a little nervous about what it means to not have this regular appointment."
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "therapist",
    "text": "That's completely understandable. Today is about consolidating your progress and reviewing the toolkit you've built. Why don't we start with you telling me: what feels most different about your life now compared to our first session?"
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "client",
    "text": "The biggest thing is I have a relationship with my own feelings. I don't run from them. When stress or that 'fraud' feeling hits, I know it's a wave to surf, not a fire to put out with a drink. I have tools. And I'm not alone—I have my SMART group and I'm actually honest with my partner now."
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "therapist",
    "text": "That's an incredible transformation. You've moved from a cycle of avoidance to one of mindful engagement. Let's review that toolkit explicitly. Can you walk me through your personal plan for maintaining recovery?"
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "client",
    "text": "Okay. The foundation is still the naltrexone. I'll keep taking that as prescribed. For daily maintenance, I use mindfulness—naming the feeling, urge surfing. I go to two SMART meetings a week; they're non-negotiable for me now. I have numbers I can call. And I practice accepting compliments instead of deflecting them. Work is stable, and I've been honest with my manager about needing a supportive environment."
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "therapist",
    "text": "That's a comprehensive and self-directed plan. It addresses the biological, psychological, and social components we mapped out from the start. What is your plan if you encounter a significant trigger or have a close call?"
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "client",
    "text": "First, I'd use the urge surfing technique immediately. Then, I'd reach out—call someone from my group or my partner. I wouldn't keep it a secret. If the thoughts got really persistent, I know I can call for a booster session here. A slip wouldn't mean a collapse; it would mean using my plan."
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "therapist",
    "text": "That shows tremendous growth. You've moved from shame-based thinking to a practical, problem-solving approach. Remember, recovery is about progress, not perfection. Is there any part of your journey or a key insight you want to make sure you hold onto as you move forward?"
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "client",
    "text": "The insight that my addiction was a solution to a problem—the problem of believing I couldn't handle my life or my feelings. The work hasn't been about stopping drinking; it's been about learning I *can* handle it. That 'I want to feel real again' feeling I had at the start? I'm starting to."
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "therapist",
    "text": "That is the core of it. You've done the hard work of building a self that doesn't need to escape. While this is the end of our regular sessions, my door is always open for tune-ups. I recommend a check-in in three months, just to touch base. How does that sound?"
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "client",
    "text": "That sounds good. Having that on the calendar feels like a safety net, but one I hope not to need. I feel ready to rely on the structure I've built."
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "therapist",
    "text": "You are ready. It has been a profound honor to walk with you through this process. From detox to building a life of mindful choice, you have shown incredible courage and commitment. My final words are just this: Continue to be the compassionate witness to your own life. You have all the tools you need."
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "client",
    "text": "Thank you. For everything. For not judging, for guiding, for helping me see this was possible. I'll see you in three months for that check-in."
  },
  {
    "conversation_id": "substanceUse5",
    "speaker": "therapist",
    "text": "I look forward to hearing about your continued progress. Take good care."
  }
]