[
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "Hello, welcome back. It's good to see you. We have a bit more time today, so we can really explore how this first full week back in your routine has been. Let's start with your experiment from last week: naming the anxiety when it arises. How did that go?"
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "Hi. It was... interesting. Some days it worked like a charm. I'd feel my chest tighten, I'd say, 'Okay, this is anxiety. It's just a wave. Ride it out.' And it would actually lessen. Other times, especially two days ago, it felt utterly useless. The thought was just too loud."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "That's a perfectly honest and normal report. Recovery isn't linear. Let's unpack both. First, celebrate the times it worked. What was different in those moments? Where were you, what was the trigger?"
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "The good times were usually smaller things. A work email, a long line at the store. The trigger two days ago was bigger. I had my first performance review since being back. My boss was actually really positive, but the whole hour before, I was in a full panic. Naming it did nothing. All I could think was, 'See? You're a fraud. They have no idea how close you were to losing everything.' The craving to just go numb was intense."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "Thank you for sharing that difficult moment. This is crucial work. So the tool worked for smaller 'waves,' but a bigger 'storm' overwhelmed it. And alongside the anxiety, a new, critical voice emerged: 'You're a fraud.' That's a powerful thought. Where do you think that comes from?"
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "It feels connected to what we talked about last time—having to be perfect or invisible to be safe. If people see the mess, the struggle, they'll reject me. So getting praise while I feel so messy inside... it creates this disconnect. The 'fraud' feeling."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "Brilliant connection. The 'fraud' thought protects you from the vulnerability of being truly seen. If you're a fraud, you don't have to believe the praise or risk future failure. It's another old survival skill. And the urge to 'go numb' is the learned solution to escape that painful internal conflict. What did you end up doing after the review?"
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "I went back to my desk and my hands were shaking. I wanted to leave and drive straight to a bar. But I didn't. I texted my partner: 'Hard craving. Got through review okay.' Just typing it out helped. Then I went to the stairwell and just walked up and down five flights. By the time I got back, the edge had dulled."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "That is a tremendous example of using your **relapse prevention plan** in action. You used a distraction (the text, the physical activity), you reached out for support, and you rode out the wave. The craving passed without you acting on it. This is how you rewrite the story: 'I had a storm, I used my tools, I got through it.' Every time that happens, the 'I can't handle this' narrative gets weaker."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "When you put it that way... yeah. I did handle it. It was awful, but I didn't drink."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "Let's solidify that new story. I want to spend some time on the concept of **urge surfing**. It's a mindfulness technique that goes beyond just naming the feeling. It involves observing the craving as a physical wave in your body—noticing where you feel it, its intensity, and watching it peak and fall without trying to fight it or give in. Can we try a brief exercise now related to that performance review moment?"
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "Okay, I'm willing to try."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "Great. Close your eyes if you're comfortable. Recall that moment sitting at your desk after the review. Notice the thought 'I'm a fraud.' Now, instead of engaging with that thought, drop your attention into your body. Where did you feel the craving? Was it a clenching in your gut? A heat in your chest? Just observe it without judgment, as if you're a scientist watching a wave. Don't try to change it. Just notice its shape, its texture. It has a beginning, a peak, and it will subside. Let's sit with that for a minute."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "(After a pause) It was... a heavy, hot ball in my stomach. And tightness in my throat. Just noticing it... it's still uncomfortable, but it feels less like a command and more like... a sensation. A really bad one, but just a sensation."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "Perfect. You've just created distance. 'Just a sensation.' That is the core of urge surfing. The goal isn't to make it pleasant; it's to learn you can observe it without being controlled by it. Practice this when cravings hit. Now, shifting gears: you mentioned going to a SMART meeting last week. What was that experience like?"
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "It was good. I just listened. Someone talked about their 'fraud' feeling too, at their family gathering. I almost cried. It was this huge relief to not be the only one. I didn't speak, but I raised my hand when they asked if anyone was new. People came up to me after and gave me their numbers. It felt... welcoming."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "That sense of shared experience is irreplaceable. It directly counters the isolation and shame. I strongly encourage you to keep going. Would you consider picking one of those numbers and texting just a 'thanks' this week? It starts building your sober network."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "I think I can do that. Yeah."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "How about the medication? Any side effects? Consistency going okay?"
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "No side effects. I take it every morning with my vitamins. It's part of the routine. I don't really think about it, which I guess is the point."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "Excellent. Now, looking ahead, we've identified a high-risk situation: performance feedback and feelings of being an imposter. Let's get proactive. What is one small way you could practice tolerating that 'fraud' feeling in a lower-stakes setting this week? To desensitize yourself to it."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "Hmm. Maybe... if my partner compliments me on something, like making dinner or being present, instead of brushing it off like I usually do, I could just say 'thank you' and sit with the awkwardness for a second. Even if I don't believe it fully."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "That is a fantastic, concrete practice. It's exposure therapy for accepting positive regard. It will feel awkward, and that critical voice will pipe up. Your job is to notice the voice, feel the sensation, surf the urge to deflect, and simply say 'thank you.' Can you commit to trying that once or twice?"
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "Yes, I can do that."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "We've covered a lot today: celebrating a success in a storm, introducing urge surfing, connecting with community, and setting a new behavioral experiment. How are you feeling as we wrap up? What's your main takeaway?"
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "I'm feeling... less fragile than last week. More equipped. The main takeaway is that the tough moments are where the real work happens. Not drinking is the baseline. Learning to live with these uncomfortable thoughts and feelings without running—that's the real recovery. And I'm not doing it alone anymore, with the group and here."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "therapist",
    "text": "You've articulated that beautifully. The baseline, and then the rebuilding. You are building resilience muscle, and it's clearly getting stronger. Your plan is robust: MAT for biology, therapy for the mind and past, group for connection, and now these mindfulness and exposure practices for the moment-to-moment work. I'll see you next week. Be proud of the work you did this week, especially during that storm."
  },
  {
    "conversation_id": "substanceUse4",
    "speaker": "client",
    "text": "Thank you. I will. See you next week."
  }
]