[
  {
    "conversation_id": "selfesteem5",
    "speaker": "therapist",
    "text": "Welcome. This is our planned final session. I’d like to start by checking in on that team meeting from last week. How did it go, and more importantly, how was the experience of using your coping plan?"
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "client",
    "text": "It went… okay. More than okay, actually. I was nervous, but I remembered the plan. Right before, I felt the anxiety in my stomach, and instead of spiraling, I thought, 'There’s the energy.' I felt my feet on the floor. I used the balanced thought: 'The goal is to share information.' And afterward, I didn't tear my performance apart. I just thought, 'I did it.'"
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "therapist",
    "text": "That is tremendous progress. You moved from a cycle of criticism to a cycle of observation and support. You ‘did it’ and you ‘noticed you did it’ without the old soundtrack. That’s the integration we’ve been working toward."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "client",
    "text": "It feels different. The belief ‘I am defective’ is still there sometimes, but it’s like a quiet radio in another room now. I don’t have to sit and listen to it. I have the tools to change the station."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "therapist",
    "text": "What a powerful way to describe it. That’s exactly the goal: not to erase every doubt, but to change your relationship to it and have a choice in how you respond. You’ve built a new internal system: the thought checker, the compassionate voice, the mindful observer, the grounded present moment."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "client",
    "text": "I feel like I have a toolkit now, where before I just had a hammer that I used to beat myself up with. It’s not that life is perfect, but I’m not powerless against my own mind anymore."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "therapist",
    "text": "That is the essence of lasting confidence: self-efficacy. Trusting that you can handle your internal experience. As we conclude, let’s solidify this. What is the single most important insight or skill you’re taking from our work?"
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "client",
    "text": "The most important thing is that a thought is not a fact. I can notice it, question it, and be kind to myself alongside it. I don’t have to *believe* the ‘defective’ story just because it plays. I have other data now."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "therapist",
    "text": "Perfectly stated. That is the core of cognitive and compassionate change. My recommendation is to continue being that ‘compassionate detective’ for yourself. Keep the case file, even briefly. Practice is what maintains the new pathways."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "client",
    "text": "What if I backslide? What if I have a bad week and the old voice gets loud again?"
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "therapist",
    "text": "That’s not backsliding; that’s being human. It’s expected. It doesn’t mean the work is undone. It means the old habit is familiar. In those moments, the practice is simply to notice, and perhaps gently pull out one tool—just one. A single mindful breath or one compassionate sentence. That is enough to reconnect with this part of yourself."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "client",
    "text": "Okay. That feels manageable. I think I can do that."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "therapist",
    "text": "I know you can. You’ve demonstrated it. You’ve done the hard work of renovating the foundation. Now you get to live in the sturdier house. It has been a genuine privilege to witness your journey and your courage."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "client",
    "text": "Thank you. Really. I came in feeling broken. I’m leaving feeling… equipped. Human. I’m so grateful for your guidance."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "therapist",
    "text": "You were never broken. You were in pain, and you learned new ways to heal. Remember that. You are always welcome to check in for a ‘booster’ session in the future if needed, but I have great confidence in your ability to support yourself now. Go well."
  },
  {
    "conversation_id": "selfesteem5",
    "speaker": "client",
    "text": "Thank you. I will. Goodbye."
  }
]